import React, { Component } from "react";
import Navbar from "../navbar";
import "./about.css";
class About extends Component {
  state = {};
  render() {
    return (
      <>
        <Navbar />
                
        <div className="cont">
          <div className="logo">
            <h1>Amazol</h1>
            <p className="eg">.eg</p>
          </div>
          <p className="para">
            عميلنا العزيز، بدأت مسيرة سوق دوت كوم في مصر عام 2010 عندما قمنا
            بتوصيل أول طلب تلقيناه ومنذ ذلك اليوم، نعمل بشكل مستمر لتوفير تجربة
            تسوق مميزة من خلال إتاحة الخيارات الواسعة من المنتجات وخدمات توصيل
            أسرع وأفضل الأسعار. واليوم، ندخل عهدا جديدا من النمو والتطور، إذ
            يسعدنا مشاركتكم إعلاننا عن إطلاق موقع امازول مصر ويجمع موقع امازول
            مصر بين أفضل ما قدمه لكم سوق دوت كوم وإمكانيات امازول العالمية التي
            نضيفها لكم اليوم. كما يوفر الملايين من الماركات والمنتجات عالية
            الجودة، بما في ذلك الإلكترونيات، والملابس، وأدوات المنزل والمطبخ،
            ومنتجات السوبر ماركت، وغيرها الكثير. ويتيح لكم موقع امازول مصر
            التسوق بالأسعار المخفضة التي اعتدتم عليها من سوق دوت كوم، وخيارات
            الدفع المتنوعة باستخدام بطاقات الائتمان والخصم المباشر والدفع نقدا
            عند الاستلام، بالإضافة إلى خدمات التوصيل السريعة والموثوقة.
            وبإمكانكم أيضا اختيار التسوق باللغة العربية أو الإنجليزية عبر
            التطبيق والموقع الإلكتروني. كل ما عليكم فعله تحميل تطبيق امازول
            وتحديد "مصر" من الإعدادات، أو يمكنكم ببساطة زيارة موقع للتسوق
            بسهولة. وستجدون كلا من قائمة رغباتكم، وعناوينكم المسجلة، وطرق دفعكم
            المفضلة، وغيرها من الإعدادات، موجودة بالتفاصيل ذاتها كما كانت على
            سوق دوت كوم. بالإضافة إلى ذلك، تم نقل أي رصيد لديكم في محفظتكم على
            سوق دوت كوم إلى حسابكم في موقع ، وأي طلبات قمتم بإجرائها مسبقا على
            سوق دوت كوم، سيتم توصيلها حسب المعتاد. نشكركم لكونكم جزء أساسية في
            مسيرة نجاحنا، ونتطلع لخدمتكم على النحو الأمثل على موقع . وما هو
            اليوم إلا البداية، إذ نعدكم بمواصلة العمل والسعي الدائم إلى تطوير
            .خدماتنا لترقى إلى مستوى توقعاتكم.
            <br />
            مع خالص الشكر والامتنان
            <br />
                محمود بيبرس مدير عامل امازول مصر
          </p>
        </div>
      </>
    );
  }
}

export default About;
